
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.ТекстЗапроса = "{" + Символ(34) + "query" + Символ(34) + ": " + Символ(34) + "query {\n             }\n  " + Символ(34) + "}";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросНаСервере()


 Разделитель = ",";
    Строки = СтрЗаменить(Объект.ИскходныйТекстДляФормированияЗапроса, Разделитель, Символы.ПС);
    Для Индекс = 1 По СтрЧислоСтрок(Объект.ИскходныйТекстДляФормированияЗапроса) Цикл
        Сообщить(СтрПолучитьСтроку(Строки, Индекс));
    КонецЦикла;
 


КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапрос(Команда)
	СформироватьЗапросНаСервере();
КонецПроцедуры
