
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем РезультатВыполнения;

	Параметры.Свойство("РезультатВыполнения", РезультатВыполнения);

	// проверка на наличие данных РезультатВыполнения
	Если Не ЗначениеЗаполнено(РезультатВыполнения) Тогда	
		Возврат;
	КонецЕсли;

				// Преобразуем реквизит формы ДЗ в объект прикладного типа
				ДеревоЗначений = РеквизитФормыВЗначение("РезультатДеревоЗначений");
				
				Для Каждого ЭлементА Из Параметры.РезультатВыполнения.data Цикл		
					СтрокаА = ДеревоЗначений.Строки.Добавить();
					СтрокаА.Наименование = ЭлементА.Ключ;
					
					Для Каждого ЭлементБ из ЭлементА.Значение Цикл
						
						СтрокаБ = СтрокаА.Строки.Добавить();
						СтрокаБ.Наименование = ЭлементБ.Ключ;
						
						Для Каждого ЭлементВ из ЭлементБ.Значение Цикл
							
								Если ЭлементВ.Свойство("Ключ") Тогда
									СтрокаВ = СтрокаБ.Строки.Добавить();
									СтрокаВ.Наименование = ЭлементВ.Ключ;
									
									Для Каждого ЭлементГ из ЭлементВ.Значение Цикл
										
										СтрокаГ = СтрокаВ.Строки.Добавить();
										СтрокаГ.Наименование = ЭлементГ.Ключ;
										
										Для Каждого ЭлементД из ЭлементГ.Значение Цикл
											
											СтрокаД = ЭлементД.Строки.Добавить();
											СтрокаД.Наименование = ЭлементД.Ключ;
											
											Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
												
												СтрокаЕ = ЭлементЕ.Строки.Добавить();
												СтрокаЕ.Наименование = ЭлементЕ.Ключ;
												СтрокаЕ.ДанныеЗначения = ЭлементЕ.Значение;
												
											КонецЦикла;							
										КонецЦикла;
									КонецЦикла;
									
									
								Иначе 
									
									
									Для Каждого ЭлементГ из ЭлементВ Цикл
										
										СтрокаВ = СтрокаБ.Строки.Добавить();
										СтрокаВ.Наименование = ЭлементГ.Ключ;
										СтрокаВ.ДанныеЗначения = ЭлементГ.Значение;
																
									КонецЦикла;
									
									
								КонецЕсли;
							

						КонецЦикла;


					КонецЦикла;
				КонецЦикла;
     
				ЗначениеВРеквизитФормы(ДеревоЗначений,"РезультатДеревоЗначений"); 





				ОтступА = Символы.Таб + "  ";
				ОтступБ = Символы.Таб + "    ";
				ОтступВ = Символы.Таб + "       ";
				ОтступГ = Символы.Таб + "          ";
				ОтступД = Символы.Таб + "            ";
				ОтступЕ = Символы.Таб + "               ";
				ОтступЖ = Символы.Таб + "                 ";
				ОтступЗ  = Символы.Таб + "                     ";





//
//		- структура
//		- структура
//			-- структура
//				--- структура
//					---- структура
//						----- структура
//						----- массив
//						----- иное
//					---- массив
//					---- иное
//				--- массив
//				--- иное
//			-- массив
//			-- иное
//		- массив
//			-- структура
//			-- массив
//				--- структура
//				--- массив
//				--- иное
//			-- иное
//		- иное
//
//
//
//		Если ЭлементГ.Количество() > 0 Тогда 
//		Для Каждого ЭлементД из ЭлементГ Цикл
//		Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
//			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//			СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ;
//				
//			Если ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
//				Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
//					
//				КонецЦикла;
//			КонецЕсли;
//			
//			Если ТипЗнч(ЭлементЕ.Значение) <> Тип("Массив") И ТипЗнч(ЭлементЕ.Значение) <> Тип("Структура") Тогда 
//				СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//				СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//			КонецЕсли;


//Дата(1626215400)

		//Если Параметры.РезультатВыполнения.data.Количество() > 0 Тогда
//		Для Каждого ЭлементА Из Параметры.РезультатВыполнения.data Цикл


//				Корень = ДеревоЗначений.Строки.Добавить();
//				Корень.Наименование = ЭлементА.Ключ;

//		Если ТипЗнч(ЭлементА.Значение) = Тип("Структура") Тогда 
//						//СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//						//СтрокаТЧРЗ.Реквизит1 = ОтступА + ЭлементА.Ключ;

//					//Если ЭлементА.Значение.Количество() > 0 Тогда 
//					Для Каждого ЭлементВ из ЭлементА.Значение Цикл
//					Если ТипЗнч(ЭлементВ.Значение) = Тип("Структура") Тогда


//						//СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//						//СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементВ.Ключ;

//									Если ЭлементВ.Значение.Количество() > 0 Тогда 
//									Для Каждого ЭлементГ из ЭлементВ.Значение Цикл
//									Если ТипЗнч(ЭлементГ.Значение) = Тип("Структура") Тогда
//												СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//												СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементГ.Ключ;

//    											Если ЭлементГ.Значение.Количество() > 0 Тогда
//												Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//   												Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
//												

//															Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//    															Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда

//    																Если ЭлементД.Количество() > 0 Тогда 
//    																	Для Каждого ЭлементЕ из ЭлементД Цикл
//    																		Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда
//    																			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//    																			СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ;

//    																					Если ЭлементЕ.Значение.Количество() > 0 Тогда
//    																						Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл

//    																								Если ТипЗнч(ЭлементЖ.Значение) = Тип("Структура") Тогда 
//    																									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//    																									СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
//    																								КонецЕсли;

//    																								Если ТипЗнч(ЭлементЖ.Значение) = Тип("Массив") Тогда
//    																										Для Каждого ЭлементЗ из ЭлементЖ.Значение Цикл

//    																										КонецЦикла;
//    																								КонецЕсли;
//    																								
//    																								Если ТипЗнч(ЭлементЖ.Значение) <> Тип("Массив") И ТипЗнч(ЭлементЖ.Значение) <> Тип("Структура") Тогда 
//    																									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//    																									СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
//    																								КонецЕсли;

//    																							КонецЦикла;
//    																						КонецЕсли;

//		    																		Если ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
//	    																				Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл

//	    																				КонецЦикла;
//		    																		КонецЕсли;
//    																		
//	    																		Если ТипЗнч(ЭлементЕ.Значение) <> Тип("Массив") И ТипЗнч(ЭлементЕ.Значение) <> Тип("Структура") Тогда 
//	    																			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//	    																			СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//	    																		КонецЕсли;

//																			КонецЕсли;
//																		КонецЦикла;

//																	КонецЕсли;
//    															КонецЕсли;
//    														КонецЦикла;
//    													КонецЕсли;

//																Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
//																КонецЕсли;

//																Если ТипЗнч(ЭлементД.Значение) <> Тип("Массив") И ТипЗнч(ЭлементД.Значение) <> Тип("Структура") Тогда 
//																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																	СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ + ": " + ЭлементД.Значение;
//																КонецЕсли;

//													КонецЦикла;
//    											КонецЕсли;

//											КонецЕсли; // ЭлементГ


//		//Если Параметры.РезультатВыполнения.data.Количество() > 0 Тогда
//		//Для Каждого ЭлементА Из Параметры.РезультатВыполнения.data Цикл
//		//Если ТипЗнч(ЭлементА.Значение) = Тип("Структура") Тогда 
//		//				СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//		//				СтрокаТЧРЗ.Реквизит1 = " " + ЭлементА.Ключ;

//															Если ТипЗнч(ЭлементГ.Значение) = Тип("Массив") Тогда
//																
//																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ;
//																
//																Если ЭлементГ.Значение.Количество() > 0 Тогда 
//																	Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//																		Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда
//																			
//																			Если ЭлементД.Количество() > 0 Тогда 
//																				Для Каждого ЭлементЕ из ЭлементД Цикл
//																					Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда
//																						
//																						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																						СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ;
//																						
//																						Если ЭлементЕ.Значение.Количество() > 0 Тогда
//																							Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
//																								СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																								СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
//																							КонецЦикла;												
//																						КонецЕсли;
//																					КонецЕсли;
//																					
//																					Если ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
//																						Если ЭлементЕ.Значение.Количество() > 0 Тогда
//																							Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
//																								
//																							КонецЦикла;
//																						КонецЕсли;
//																					КонецЕсли;
//																					
//																					Если ТипЗнч(ЭлементЕ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементЕ.Значение) <> Тип("Массив") Тогда
//																						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																						СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//																					КонецЕсли;
//																					
//																				КонецЦикла;
//																			КонецЕсли;
//																		КонецЕсли;
//																	КонецЦикла;
//																КонецЕсли;
//															КонецЕсли;

//																Если ТипЗнч(ЭлементГ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементГ.Значение) <> Тип("Массив") Тогда 
//																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																	СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ + ": " + ЭлементГ.Значение;
//																КонецЕсли;

//										КонецЦикла; // ЭлементГ
//									КонецЕсли; // ЭлементГ

//							КонецЕсли; // ЭлементВ

//								Если ТипЗнч(ЭлементВ.Значение) = Тип("Массив") Тогда
//									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//									СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементВ.Ключ;
//									
//										Если ЭлементВ.Значение.Количество() > 0 Тогда 
//											Для Каждого ЭлементГ из ЭлементВ.Значение Цикл
//												Если ТипЗнч(ЭлементГ) = Тип("Структура") Тогда

//													Если ЭлементГ.Свойство("Ключ") Тогда
//														СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//														СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ;
//													КонецЕсли;

//													Если ЭлементГ.Количество() > 0 Тогда 
//														Для Каждого ЭлементД из ЭлементГ Цикл
//															Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
//																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ;
//																
//																Если ЭлементД.Значение.Количество() > 0 Тогда
//																Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
//																	Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда
//																		СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																		СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//// ЭлементЕ.Значение  =  НеОпределено
//																			Если ЭлементЕ.Значение.Количество() > 0 Тогда 
//																				Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
//																					Если ТипЗнч(ЭлементЖ.Значение) = Тип("Структура") Тогда
//																						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																						СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ;
//																					КонецЕсли;
//																				КонецЦикла;
//																			КонецЕсли;

//																		Если ТипЗнч(ЭлементЕ) <> Тип("Структура") И ТипЗнч(ЭлементЕ) <> Тип("Массив") Тогда
//																			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																			СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//																		КонецЕсли;

//																	КонецЕсли;

//																	Если ТипЗнч(ЭлементЕ) <> Тип("Структура") И ТипЗнч(ЭлементЕ) <> Тип("Массив") Тогда
//																		СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																		СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
//																	КонецЕсли;

//																КонецЦикла;												
//																КонецЕсли;
//															КонецЕсли;
//															
//															Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
//																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ;

//																	Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда
//																		Если ЭлементД.Количество() > 0 Тогда 
//																			Для Каждого ЭлементЕ из ЭлементД Цикл
//																				Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
//																					СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																					СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ;
//																					
//																					Если ЭлементЕ.Значение.Количество() > 0 Тогда
//																						Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
//																							СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																							СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
//																						КонецЦикла;
//																					КонецЕсли;
//																				КонецЕсли;
//																			КонецЦикла;
//																		КонецЕсли;
//																	КонецЕсли;
//															КонецЕсли;
//															
//															Если ТипЗнч(ЭлементД) <> Тип("Структура") И ТипЗнч(ЭлементД) <> Тип("Массив") Тогда
//																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ + ": " + ЭлементД.Значение;
//															КонецЕсли;
//															
//														КонецЦикла;
//													КонецЕсли;
//												КонецЕсли;

//												Если ТипЗнч(ЭлементГ) = Тип("Массив") Тогда
//													Если ЭлементГ.Значение.Количество() > 0 Тогда
//														Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//															
//														КонецЦикла;
//													КонецЕсли
//												КонецЕсли;

//												Если ТипЗнч(ЭлементГ) <> Тип("Структура") И ТипЗнч(ЭлементГ) <> Тип("Массив") Тогда 
//													СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//													СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ + ": " + ЭлементГ.Значение;
//												КонецЕсли;

//											КонецЦикла;
//										КонецЕсли;
//								КонецЕсли;

//								Если ТипЗнч(ЭлементВ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементВ.Значение) <> Тип("Массив") Тогда 
//									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//									СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементВ.Ключ + ": " + ЭлементВ.Значение;
//								КонецЕсли;

//						КонецЦикла; // ЭлементВ
//					//КонецЕсли; // ЭлементВ

//				КонецЕсли; // ЭлементА

//					Если ТипЗнч(ЭлементА.Значение) = Тип("Массив") Тогда
//						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//						СтрокаТЧРЗ.Реквизит1 = ОтступА + ЭлементА.Ключ;
//						
//							Если ЭлементА.Значение.Количество() > 0 Тогда 
//								Для Каждого ЭлементВ из ЭлементА.Значение Цикл
//									Если ТипЗнч(ЭлементВ) = Тип("Структура") Тогда
//										
//										Если ЭлементВ.Количество() > 0 Тогда 
//											Для Каждого ЭлементГ из ЭлементВ Цикл
//												Если ТипЗнч(ЭлементГ.Значение) = Тип("Структура") Тогда
//													
//													СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//													СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ;
//													
//														Если ЭлементГ.Значение.Количество() > 0 Тогда
//															Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ + ": " + ЭлементД.Значение;
//															КонецЦикла;
//														КонецЕсли;
//													КонецЕсли;
//													
//													Если ТипЗнч(ЭлементГ.Значение) = Тип("Массив") Тогда
//														Если ЭлементГ.Значение.Количество() > 0 Тогда
//															Для Каждого ЭлементД из ЭлементГ.Значение Цикл
//																
//															КонецЦикла;
//														КонецЕсли;
//													КонецЕсли;
//												
//												Если ТипЗнч(ЭлементГ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементГ.Значение) <> Тип("Массив") Тогда
//													СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//													СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ + ": " + ЭлементГ.Значение;
//												КонецЕсли;
//												
//											КонецЦикла;
//										КонецЕсли;
//									КонецЕсли;
//								КонецЦикла;
//							КонецЕсли;
//					КонецЕсли;

//				Если ТипЗнч(ЭлементА.Значение) <> Тип("Структура") И ТипЗнч(ЭлементА.Значение) <> Тип("Массив") Тогда 
//					СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
//					СтрокаТЧРЗ.Реквизит1 = ОтступА + ЭлементА.Ключ + ": " + ЭлементА.Значение;
//				КонецЕсли;

//			КонецЦикла; // ЭлементА
//		//КонецЕсли; // ЭлементА

КонецПроцедуры

&НаКлиенте
Процедура РезультатДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Возврат
	КонецЕсли;

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДаннДляОтображения", Элемент.ТекущиеДанные.ДанныеЗначения);
	ПараметрыФормы.Вставить("ВыборДляОтображения", Элемент.ТекущиеДанные.Наименование);
	ПараметрыФормы.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);

	ОткрытьФорму("ОбщаяФорма.ПодробныеДанные", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
