
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем РезультатВыполнения;

	Параметры.Свойство("РезультатВыполнения", РезультатВыполнения);

	// проверка на наличие данных РезультатВыполнения
	Если Не ЗначениеЗаполнено(РезультатВыполнения) Тогда	
		Возврат;
	КонецЕсли;

  //Таб = Новый ТаблицаЗначений;
  //Таб.Колонки.Колонки.Добавить("Фрукт");

		Если Параметры.РезультатВыполнения.data.Количество() > 0 Тогда
			Для Каждого СтрокаПолученныйОтвет Из Параметры.РезультатВыполнения.data Цикл 
				Если ТипЗнч(СтрокаПолученныйОтвет.Значение) = Тип("Структура") Тогда
					Для Каждого ЭлементВ из СтрокаПолученныйОтвет.Значение Цикл

//РезультатТаблицаЗначений..кол.Колонки.Добавить("Фрукт");
//СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить("Фк");

					СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
					СтрокаТЧРЗ.Реквизит1 = ЭлементВ.Ключ;

						Если ТипЗнч(ЭлементВ.Значение) = Тип("Массив") Тогда
							Если ЭлементВ.Значение.Количество() > 0 Тогда 
								Для Каждого ЭлементГ из ЭлементВ.Значение Цикл

										//ЭлементД
										//ЭлементЕ
										//ЭлементЖ
										//ЭлементЗ

								КонецЦикла;							
							КонецЕсли;
						ИначеЕсли ТипЗнч(ЭлементВ.Значение) = Тип("Структура") Тогда
							Если ЭлементВ.Значение.Количество() > 0 Тогда 
								Для Каждого ЭлементГ из ЭлементВ.Значение Цикл

										СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
										СтрокаТЧРЗ.Реквизит1 = ЭлементГ.Ключ;

													Если ТипЗнч(ЭлементГ.Значение) = Тип("Массив") Тогда
														Если ЭлементГ.Значение.Количество() > 0 Тогда 
															Для Каждого ЭлементД из ЭлементГ.Значение Цикл

																	//ЭлементЕ
																	//ЭлементЖ
																	//ЭлементЗ

															КонецЦикла;							
														КонецЕсли;
													ИначеЕсли ТипЗнч(ЭлементГ.Значение) = Тип("Структура") Тогда
														Если ЭлементГ.Значение.Количество() > 0 Тогда 
															Для Каждого ЭлементД из ЭлементГ.Значение Цикл

																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																	СтрокаТЧРЗ.Реквизит1 = ЭлементД.Ключ;


																			Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
																				Если ЭлементД.Значение.Количество() > 0 Тогда 
																					Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
																							
																							//ЭлементЖ
																							//ЭлементЗ

																					КонецЦикла;							
																				КонецЕсли;
																			ИначеЕсли ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
																				Если ЭлементД.Значение.Количество() > 0 Тогда 
																					Для Каждого ЭлементЕ из ЭлементД.Значение Цикл

																							СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																							СтрокаТЧРЗ.Реквизит1 = ЭлементЕ.Ключ;

																							//ЭлементЖ
																							//ЭлементЗ

																					КонецЦикла;							
																				КонецЕсли;
																			КонецЕсли;

																	//ЭлементЕ
																	//ЭлементЖ
																	//ЭлементЗ

															КонецЦикла;							
														КонецЕсли;
													КонецЕсли;


								КонецЦикла;							
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли  ТипЗнч(СтрокаПолученныйОтвет.Значение) = Тип("Массив") Тогда
					Если СтрокаПолученныйОтвет.Значение.Количество() > 0 Тогда
						Для Каждого ЭлементВ из СтрокаПолученныйОтвет.Значение Цикл


										//ЭлементГ
										//ЭлементД
										//ЭлементЕ
										//ЭлементЖ
										//ЭлементЗ



						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

КонецПроцедуры
