
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем РезультатВыполнения;

	Параметры.Свойство("РезультатВыполнения", РезультатВыполнения);

	// проверка на наличие данных РезультатВыполнения
	Если Не ЗначениеЗаполнено(РезультатВыполнения) Тогда	
		Возврат;
	КонецЕсли;

		РегистрОбходаЭлементА = 0;
		РегистрОбходаЭлементБ = 0;
		РегистрОбходаЭлементВ = 0;
		РегистрОбходаЭлементГ = 0;
		РегистрОбходаЭлементД = 0;
		РегистрОбходаЭлементЕ = 0;
		РегистрОбходаЭлементЖ = 0;
		РегистрОбходаЭлементЗ = 0;

				ОтступА = Символы.Таб + "  ";
				ОтступБ = Символы.Таб + "   ";
				ОтступВ = Символы.Таб + "    ";
				ОтступГ = Символы.Таб + "     ";
				ОтступД = Символы.Таб + "      ";
				ОтступЕ = Символы.Таб + "       ";
				ОтступЖ = Символы.Таб + "        ";
				ОтступЗ  = Символы.Таб + "         ";

		Если Параметры.РезультатВыполнения.data.Количество() > 0 Тогда
		Для Каждого ЭлементА Из Параметры.РезультатВыполнения.data Цикл
		Если ТипЗнч(ЭлементА.Значение) = Тип("Структура") Тогда 
						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
						СтрокаТЧРЗ.Реквизит1 = ОтступА + ЭлементА.Ключ;

					Если ЭлементА.Значение.Количество() > 0 Тогда 
					Для Каждого ЭлементВ из ЭлементА.Значение Цикл
					Если ТипЗнч(ЭлементВ.Значение) = Тип("Структура") Тогда

						//СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
						//СтрокаТЧРЗ.Реквизит1 = "  " + ЭлементВ.Ключ;

									Если ЭлементВ.Значение.Количество() > 0 Тогда 
									Для Каждого ЭлементГ из ЭлементВ.Значение Цикл
									Если ТипЗнч(ЭлементГ.Значение) = Тип("Структура") Тогда
												СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
												СтрокаТЧРЗ.Реквизит1 = "   " + ЭлементГ.Ключ;

    											Если ЭлементГ.Значение.Количество() > 0 Тогда
												Для Каждого ЭлементД из ЭлементГ.Значение Цикл
   												Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
												

															Для Каждого ЭлементД из ЭлементГ.Значение Цикл
    															Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда

    																Если ЭлементД.Количество() > 0 Тогда 
    																	Для Каждого ЭлементЕ из ЭлементД Цикл
    																		Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда
    																			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
    																			СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ;

    																					Если ЭлементЕ.Значение.Количество() > 0 Тогда
    																						Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл

    																								Если ТипЗнч(ЭлементЖ.Значение) = Тип("Структура") Тогда 
    																									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
    																									СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
    																								КонецЕсли;

    																								Если ТипЗнч(ЭлементЖ.Значение) = Тип("Массив") Тогда
    																										Для Каждого ЭлементЗ из ЭлементЖ.Значение Цикл

    																										КонецЦикла;
    																								КонецЕсли;
    																								
    																								Если ТипЗнч(ЭлементЖ.Значение) <> Тип("Массив") И ТипЗнч(ЭлементЖ.Значение) <> Тип("Структура") Тогда 
    																									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
    																									СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
    																								КонецЕсли;

    																							КонецЦикла;
    																						КонецЕсли;

		    																		Если ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
	    																				Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл

	    																				КонецЦикла;
		    																		КонецЕсли;
    																		
	    																		Если ТипЗнч(ЭлементЕ.Значение) <> Тип("Массив") И ТипЗнч(ЭлементЕ.Значение) <> Тип("Структура") Тогда 
	    																			СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
	    																			СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
	    																		КонецЕсли;

																			КонецЕсли;
																		КонецЦикла;

																	КонецЕсли;
    															КонецЕсли;
    														КонецЦикла;
    													КонецЕсли;

																Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
																КонецЕсли;

																Если ТипЗнч(ЭлементД.Значение) <> Тип("Массив") И ТипЗнч(ЭлементД.Значение) <> Тип("Структура") Тогда 
																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																	СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ + ": " + ЭлементД.Значение;
																КонецЕсли;

													КонецЦикла;
    											КонецЕсли;

											КонецЕсли; // ЭлементГ


		//Если Параметры.РезультатВыполнения.data.Количество() > 0 Тогда
		//Для Каждого ЭлементА Из Параметры.РезультатВыполнения.data Цикл
		//Если ТипЗнч(ЭлементА.Значение) = Тип("Структура") Тогда 
		//				СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//				СтрокаТЧРЗ.Реквизит1 = " " + ЭлементА.Ключ;

															Если ТипЗнч(ЭлементГ.Значение) = Тип("Массив") Тогда
																
																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ;
																
																Если ЭлементГ.Значение.Количество() > 0 Тогда 
																	Для Каждого ЭлементД из ЭлементГ.Значение Цикл
																		Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда
																			
																			Если ЭлементД.Количество() > 0 Тогда 
																				Для Каждого ЭлементЕ из ЭлементД Цикл
																					Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда
																						
																						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																						СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ;
																						
																						Если ЭлементЕ.Значение.Количество() > 0 Тогда
																							Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
																								СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																								СтрокаТЧРЗ.Реквизит1 = ОтступЖ + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
																							КонецЦикла;												
																						КонецЕсли;
																					КонецЕсли;
																					
																					Если ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
																						Если ЭлементЕ.Значение.Количество() > 0 Тогда
																							Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
																								
																							КонецЦикла;
																						КонецЕсли;
																					КонецЕсли;
																					
																					Если ТипЗнч(ЭлементЕ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементЕ.Значение) <> Тип("Массив") Тогда
																						СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																						СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
																					КонецЕсли;
																					
																				КонецЦикла;
																			КонецЕсли;
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;

																Если ТипЗнч(ЭлементГ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементГ.Значение) <> Тип("Массив") Тогда 
																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																	СтрокаТЧРЗ.Реквизит1 = ОтступГ + ЭлементГ.Ключ + ": " + ЭлементГ.Значение;
																КонецЕсли;

										КонецЦикла; // ЭлементГ
									КонецЕсли; // ЭлементГ

							КонецЕсли; // ЭлементВ

								Если ТипЗнч(ЭлементВ.Значение) = Тип("Массив") Тогда
									
									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
									СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементВ.Ключ;
									
										Если ЭлементВ.Значение.Количество() > 0 Тогда 
											Для Каждого ЭлементГ из ЭлементВ.Значение Цикл
												Если ТипЗнч(ЭлементГ) = Тип("Структура") Тогда
													
													Если ЭлементГ.Количество() > 0 Тогда 
														Для Каждого ЭлементД из ЭлементГ Цикл
															Если ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
																
																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ;
																
																Если ЭлементД.Значение.Количество() > 0 Тогда
																	Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
																		СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																		СтрокаТЧРЗ.Реквизит1 = ОтступЕ + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
																	КонецЦикла;												
																КонецЕсли;
															КонецЕсли;
															
															Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
																Если ЭлементД.Значение.Количество() > 0 Тогда
																	Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
																		
																	КонецЦикла;
																КонецЕсли;
															КонецЕсли;
															
															Если ТипЗнч(ЭлементД.Значение) <> Тип("Структура") И ТипЗнч(ЭлементД.Значение) <> Тип("Массив") Тогда
																СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
																СтрокаТЧРЗ.Реквизит1 = ОтступД + ЭлементД.Ключ + ": " + ЭлементД.Значение;
															КонецЕсли;
															
														КонецЦикла;
													КонецЕсли;
												КонецЕсли;
											КонецЦикла;
										КонецЕсли;

								КонецЕсли;

								Если ТипЗнч(ЭлементВ.Значение) <> Тип("Структура") И ТипЗнч(ЭлементВ.Значение) <> Тип("Массив") Тогда 
									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
									СтрокаТЧРЗ.Реквизит1 = ОтступВ + ЭлементВ.Ключ + ": " + ЭлементВ.Значение;
								КонецЕсли;

						КонецЦикла; // ЭлементВ
					КонецЕсли; // ЭлементВ

				КонецЕсли; // ЭлементА


						Если ТипЗнч(ЭлементА.Значение) = Тип("Массив") Тогда
						КонецЕсли;

						Если ТипЗнч(ЭлементА.Значение) <> Тип("Структура") И ТипЗнч(ЭлементА.Значение) <> Тип("Массив") Тогда 
							СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
							СтрокаТЧРЗ.Реквизит1 = ОтступА + ЭлементА.Ключ + ": " + ЭлементА.Значение;
						КонецЕсли;

			КонецЦикла; // ЭлементА
		КонецЕсли; // ЭлементА






///--------------------





		//				ИначеЕсли ТипЗнч(ЭлементВ.Значение) = Тип("Массив") Тогда
		//					Если ЭлементВ.Значение.Количество() > 0 Тогда 
		//						Для Каждого ЭлементГ из ЭлементВ.Значение Цикл

		//								//ЭлементД
		//								//ЭлементЕ
		//								//ЭлементЖ
		//								//ЭлементЗ

		//						КонецЦикла;							
		//					КонецЕсли;
		//				ИначеЕсли ТипЗнч(ЭлементВ.Значение) = Тип("Структура") Тогда
		//					Если ЭлементВ.Значение.Количество() > 0 Тогда 
		//						Для Каждого ЭлементГ из ЭлементВ.Значение Цикл

		//								Если РегистрОбходаЭлементГ = 0 Тогда 
		//									СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//									СтрокаТЧРЗ.Реквизит1 = "    " + ЭлементГ.Ключ;
		//									РегистрОбходаЭлементГ = 1;
		//								КонецЕсли;

		//								Если ТипЗнч(ЭлементГ.Значение) = Тип("Массив") Тогда
		//									Если ЭлементГ.Значение.Количество() > 0 Тогда 
		//										Для Каждого ЭлементД из ЭлементГ.Значение Цикл
		//											Если ТипЗнч(ЭлементД) = Тип("Структура") Тогда
		//												Если ЭлементД.Количество() > 0 Тогда 
		//													Для Каждого ЭлементЕ из ЭлементД Цикл
		//														Если ТипЗнч(ЭлементЕ.Значение) = Тип("Структура") Тогда

		//															СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//															СтрокаТЧРЗ.Реквизит1 = "      " + ЭлементЕ.Ключ;

		//																Если ЭлементЕ.Значение.Количество() > 0 Тогда
		//																	Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
		//																		СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//																		СтрокаТЧРЗ.Реквизит1 = "       " + ЭлементЖ.Ключ + ": " + ЭлементЖ.Значение;
		//																	КонецЦикла;												
		//																КонецЕсли;
		//														ИначеЕсли ТипЗнч(ЭлементЕ.Значение) = Тип("Массив") Тогда
		//															Если ЭлементЕ.Значение.Количество() > 0 Тогда
		//																Для Каждого ЭлементЖ из ЭлементЕ.Значение Цикл
		//																	
		//																КонецЦикла;
		//															КонецЕсли;
		//														Иначе 
		//															СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//															СтрокаТЧРЗ.Реквизит1 = "      " + ЭлементЕ.Ключ + ": " + ЭлементЕ.Значение;
		//														КонецЕсли;

		//													КонецЦикла;
		//												КонецЕсли;
		//											КонецЕсли;



		//										КонецЦикла;							
		//									КонецЕсли;
		//								ИначеЕсли ТипЗнч(ЭлементГ.Значение) = Тип("Структура") Тогда
		//									Если ЭлементГ.Значение.Количество() > 0 Тогда 
		//										Для Каждого ЭлементД из ЭлементГ.Значение Цикл

		//											СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//											СтрокаТЧРЗ.Реквизит1 = ЭлементД.Ключ;

		//													Если ТипЗнч(ЭлементД.Значение) = Тип("Массив") Тогда
		//														Если ЭлементД.Значение.Количество() > 0 Тогда 
		//															Для Каждого ЭлементЕ из ЭлементД.Значение Цикл
		//																	
		//																	//ЭлементЖ
		//																	//ЭлементЗ

		//															КонецЦикла;							
		//														КонецЕсли;
		//													ИначеЕсли ТипЗнч(ЭлементД.Значение) = Тип("Структура") Тогда
		//														Если ЭлементД.Значение.Количество() > 0 Тогда 
		//															Для Каждого ЭлементЕ из ЭлементД.Значение Цикл

		//																	СтрокаТЧРЗ = РезультатТаблицаЗначений.Добавить();
		//																	СтрокаТЧРЗ.Реквизит1 = "      " + ЭлементЕ.Ключ;

		//																	//ЭлементЖ
		//																	//ЭлементЗ

		//															КонецЦикла;							
		//														КонецЕсли;
		//													ИначеЕсли ТипЗнч(ЭлементД.Значение) = Тип("Строка") Тогда
		//														СтрокаТЧРЗ.Реквизит1 = "     " + СтрокаТЧРЗ.Реквизит1 +  ":  " + ЭлементД.Значение;
		//													КонецЕсли;

		//											//ЭлементЕ
		//											//ЭлементЖ
		//											//ЭлементЗ

		//										КонецЦикла;							
		//									КонецЕсли;
		//								КонецЕсли;

		//						КонецЦикла;							
		//					КонецЕсли;
		//				КонецЕсли; //3
		//			КонецЦикла;
		//		КонецЕсли;




		//		ИначеЕсли  ТипЗнч(ЭлементА.Значение) = Тип("Массив") Тогда
		//			Если ЭлементА.Значение.Количество() > 0 Тогда
		//				Для Каждого ЭлементВ из ЭлементА.Значение Цикл

		//					//ЭлементГ
		//					//ЭлементД
		//					//ЭлементЕ
		//					//ЭлементЖ
		//					//ЭлементЗ

		//				КонецЦикла;
		//			КонецЕсли;

		//		ИначеЕсли ТипЗнч(ЭлементА.Значение) = Тип("Строка") Тогда
		//			СтрокаТЧРЗ.Реквизит1 = " " + СтрокаТЧРЗ.Реквизит1 +  ":  " + ЭлементА.Значение;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЕсли;

КонецПроцедуры




















