
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьЗащищенныеДанные();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗащищенныеДанные()

	Для Каждого стр Из Объект.ЗащищенныеДанные Цикл
		стр.Значение = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, Строка(стр.ИмяДанных));
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьЗащищенныеДанные();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого стр Из Объект.ЗащищенныеДанные Цикл
			Если стр.Значение = "" Тогда 
				Продолжить;
			КонецЕсли;
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Ссылка, стр.Значение, Строка(стр.ИмяДанных));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенныеДанныеИмяДанныхОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если Текст = Неопределено Или Текст = "" Тогда
		Объект.ЗащищенныеДанные.Удалить(Этаформа.элементы.ЗащищенныеДанные.ТекущаяСтрока); 
		Возврат;
	КонецЕсли;

	Если ПроверкаНаСовпадениеЧисла(Текст) Тогда		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Наименование имена данных не должно начинаться с цифры!", 0, "Внимание!");

		Объект.ЗащищенныеДанные.Удалить(Этаформа.элементы.ЗащищенныеДанные.ТекущаяСтрока);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
КонецПроцедуры

&НаСервере
Функция ПроверкаНаСовпадениеЧисла(Текст)
	
	ИскомыйМассив = Новый Массив();
		ИскомыйМассив.Добавить("1");
		ИскомыйМассив.Добавить("2");
		ИскомыйМассив.Добавить("3");
		ИскомыйМассив.Добавить("4");
		ИскомыйМассив.Добавить("5");
		ИскомыйМассив.Добавить("6");
		ИскомыйМассив.Добавить("7");
		ИскомыйМассив.Добавить("8");
		ИскомыйМассив.Добавить("9");
		ИскомыйМассив.Добавить("0");

		Если ИскомыйМассив.Найти(Лев(Текст, 1)) = Неопределено Тогда 
			Возврат Ложь;
		КонецЕсли;

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ЗащищенныеДанныеЗначениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Этаформа.элементы.ЗащищенныеДанные.ТекущиеДанные.ИмяДанных = "" Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Не указано наименование имени данных!", 0, "Внимание!");

		Объект.ЗащищенныеДанные.Удалить(Этаформа.элементы.ЗащищенныеДанные.ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры



