
&НаСервере
Процедура ЗапросИзмененияРейсовНаСервере()
	LeonSoftwareCommonModules.ПолучитьИзмененияРейсов();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросИзмененияРейсов(Команда)
	ЗапросИзмененияРейсовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросОбменЛеонНаСервере()
	LeonSoftwareCommonModules.ОбменЛеон();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросОбменЛеон(Команда)
	ЗапросОбменЛеонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросПолучитьРейсыНаСервере()
	LeonSoftwareCommonModules.ПолучитьРейсы(ДатаПериод.ДатаНачала, ДатаПериод.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПолучитьРейсы(Команда)
	ЗапросПолучитьРейсыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапросПоЭЛНаСервере()
	LeonSoftwareCommonModules.ПолучитьЭмптиЛегиРейсов();
КонецПроцедуры

&НаКлиенте
Процедура ЗапросПоЭЛ(Команда)
	ЗапросПоЭЛНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросНаСервере(ТекстЗапроса)
// ttp://api-schema-doc.s3-website-eu-west-1.amazonaws.com/schema-beta.json
	ПолученныйОтвет = LeonSoftwareCommonModules.ПолучитьОтветНаЗапросЛеонСофт(ТекстЗапроса, ВнешнийСервис);

		Если ПолученныйОтвет.Количество() > 0 Тогда 
			Для Каждого СтрокаПолученныйОтвет Из ПолученныйОтвет Цикл 
				Если ТипЗнч(СтрокаПолученныйОтвет.Значение) = Тип("Структура") Тогда
					Для Каждого ЭлементВ из СтрокаПолученныйОтвет.Значение Цикл
	 				 Сообщить(ЭлементВ.Ключ);
						Если ТипЗнч(ЭлементВ.Значение) = Тип("Массив") Тогда
							Если ЭлементВ.Значение.Количество() > 0 Тогда 
								Для Каждого ЭлементГ из ЭлементВ.Значение Цикл

										//ЭлементД
										//ЭлементЕ
										//ЭлементЖ
										//ЭлементЗ




								КонецЦикла;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗапрос(Команда)

	Если ВнешнийСервис.Пустая() Тогда 
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, "Текст запроса не заполнен! ", 0, "Внимание!");
		Возврат;
	КонецЕсли;

	Если ВыбратьИзСправочника Тогда
		Если ТекстВыбранногоЗапроса.Пустая() Или ПолучитьТекстЗапросаСправочника(ТекстВыбранногоЗапроса) = "" Тогда 
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение, "Текст запроса не заполнен! ", 0, "Внимание!");
			Возврат;
		КонецЕсли;

		ОтправитьЗапросНаСервере(ПолучитьТекстЗапросаСправочника(ТекстВыбранногоЗапроса));
	Иначе
		Если ЗапросТекст = "" Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
			ПоказатьПредупреждение(Оповещение, "Текст запроса не заполнен! ", 0, "Внимание!");
			Возврат;
		КонецЕсли;

		ОтправитьЗапросНаСервере(ЗапросТекст);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьТекстЗапросаСправочника(ТекстВыбранногоЗапроса)
	Возврат ТекстВыбранногоЗапроса.Ссылка.ТекстЗапроса;
КонецФункции

&НаКлиенте
Процедура ВыбратьИзСправочникаПриИзменении(Элемент)

	Если ВыбратьИзСправочника Тогда
		ЭтаФорма.Элементы.ТекстВыбранногоЗапроса.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ТекстВыбранногоЗапроса.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
