
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ДаннДляОтображения, ВыборДляОтображения, ВыбраннаяСтрока;

	Параметры.Свойство("ДаннДляОтображения", ДаннДляОтображения);
	Параметры.Свойство("ВыборДляОтображения", ВыборДляОтображения);
	Параметры.Свойство("ВыбраннаяСтрока", ВыбраннаяСтрока);

	// проверка на наличие данных РезультатВыполнения
	Если Не ЗначениеЗаполнено(ДаннДляОтображения) Тогда	
		Возврат;
	КонецЕсли;

	//КЧ = Новый КвалификаторыЧисла(12,2);
	//КС = Новый КвалификаторыСтроки(20);
	//Массив = Новый Массив;
	//Массив.Добавить(Тип("Строка"));
	//ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	//Массив.Очистить();
	//Массив.Добавить(Тип("Число"));
	//ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);

	//ТЗв = Новый ТаблицаЗначений;
	//	Для Каждого СтрокаДанных Из ДаннДляОтображения Цикл 
	//		ТЗв.Колонки.Добавить(Строка(СтрокаДанных.Ключ), ОписаниеТиповС, Строка(СтрокаДанных.Ключ), 15);
	//	КонецЦикла;

	//	Для Каждого СтрокаТЗв Из ДаннДляОтображения Цикл
	//		НоваяСтрокаТЗ = ТЗв.Добавить();
	//		НоваяСтрокаТЗ[Строка(СтрокаТЗв.Ключ)] = СтрокаТЗв.Значение;
	//	КонецЦикла;

	ВывестиТаблицуНаФорму(ЭтаФорма, "ПодробнДаннТаблЗнач", СтруктураВТаблицуЗначенийСОписаниемТипов(ДаннДляОтображения));

КонецПроцедуры

&НаСервере
Функция СтруктураВТаблицуЗначенийСОписаниемТипов(Структра) 
	
	ТЗ = Новый ТаблицаЗначений;
	НовСтр=ТЗ.Добавить();
	ОписаниеТиповСсылок = Новый ОписаниеТипов(Новый ОписаниеТипов(Справочники.ТипВсеСсылки(), Документы.ТипВсеСсылки().Типы(),Перечисления.ТипВсеСсылки().Типы() ));

	Для Каждого ТекЭлем из Структра Цикл
		
		ТЗ.Колонки.Добавить(ТекЭлем.Ключ, 
			?(ОписаниеТиповСсылок.СодержитТип(ТипЗнч(ТекЭлем.Значение)),
			Новый ОписаниеТипов(СтрЗаменить(ТекЭлем.Значение.Метаданные().ПолноеИмя(),".","Ссылка.")),
			Новый ОписаниеТипов(Строка(ТипЗнч(ТекЭлем.Значение)))));
			
		НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;                          
		
	КонецЦикла;
 	
	Возврат ТЗ;
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуНаФорму(УФ, ИмяТЗНаФорме, ТЗ, ТЗОбработчиковСобытий = Неопределено) 

   // СОЗДАНИЕ РЕКВИЗИТОВ ФОРМЫ
    МассивДобавляемыхРеквизитов = Новый Массив; 
    
    Для Каждого Колонка Из ТЗ.Колонки Цикл
        МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТЗНаФорме, Колонка.Заголовок));    
    КонецЦикла; 
    
    МассивУдаляемыхРеквизитов = ЭтаФорма.ПолучитьРеквизиты(ИмяТЗНаФорме);
    МассивИменУдаляемыхРеквизитов = Новый Массив;
    Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
        МассивИменУдаляемыхРеквизитов.Добавить(ИмяТЗНаФорме + "." + Элемент.Имя);
    КонецЦикла;
    
		Если МассивИменУдаляемыхРеквизитов.Количество() > 0 Тогда 
			УФ.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивИменУдаляемыхРеквизитов); 
		КонецЕсли;

    // СОЗДАНИЕ ЭЛЕМЕНТОВ ФОРМЫ
    Для каждого Элемент Из МассивУдаляемыхРеквизитов Цикл
        УдаляемыйЭлемент = УФ.Элементы.Найти(ИмяТЗНаФорме + Элемент.Имя);
        УФ.Элементы.Удалить(УдаляемыйЭлемент);
    КонецЦикла;

    Для Каждого Колонка Из ТЗ.Колонки Цикл
			НоваяКолонка = УФ.Элементы.Добавить(ИмяТЗНаФорме + "_" + Колонка.Имя, Тип("ПолеФормы"), УФ.Элементы["ЭлементПодробнДаннТаблЗнач"]); 
			НоваяКолонка.Заголовок = Колонка.Заголовок; 
			НоваяКолонка.ПутьКДанным = ИмяТЗНаФорме + "." + Колонка.Имя; 
			НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
			НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;    
	КонецЦикла;     
    
    УФ[ИмяТЗНаФорме].Загрузить(ТЗ);
    
    // Привязка обработчиков событий
    Если ТЗОбработчиковСобытий = Неопределено Тогда
        Возврат;
    КонецЕсли;    
    
    Для Каждого Строка Из ТЗОбработчиковСобытий Цикл
        УФ.Элементы[Строка.ИмяЭлемента].УстановитьДействие(Строка.ИмяСобытия, Строка.ИмяЭлемента + Строка.ИмяСобытия); 
    КонецЦикла;   

КонецПроцедуры
